call env.bat

rem Получение поступивших счетов-фактур в каталог recv.
rem 
rem Получение поступивших выполняется в следующем порядке: 
rem 
rem 1. Утилита подключается к сервису по защищенному TLS соединению с авторизацией пользователя по сертификату.
rem 	Адрес веб сервиса определяется переменной среды EINV_PORTAL_URL.
rem 	Выбор ключа и сертификата клиента для авторизации производится из справочника MY. 
rem 
rem 2. Из файла recv\last.update.time считывается дата последнего обращениея на сервис за счетами-фактурами.
rem     Если файл отсутствует, то дата принимается как текушая дата - 365 дней.
rem
rem 3. Выполняется запрос поступивших счетов-фактур у сервиса портала с указанием даты, полученной на шаге 2.
rem 
rem 3. Далее для каждого счета-фактуры из полученного списка выполняются следующие действия: 
rem
rem 	3.1 Проверяется наличие в каталоге recv файла с именем: "invoice-номер_счёта_фактуры.sgn.xml". 
rem
rem 	3.2 Если файл отсутствует, счет-фактура скачивается с сервиса портала.
rem
rem     3.3 Проверяются ЭЦП скачанного счета-фактуры. Если проверка успешна, счет-фактура 
rem      сохраняется в каталог recv с именем: "invoice-номер_счёта_фактуры.sgn.xml".
rem      Если проверка ЭЦП завершилась неуспешно, счет-фактура сохраняется с именем 
rem      "invoice-номер_счёта_фактуры.sgn.error.xml".
rem 
rem 4. По окончанию обработки списка счетов-фактур сохраняется файл recv\last.update.time.
rem 	В него записывается дата, полученная с сервиса в ответе со списком счетов-фактур.

%VBRUN% src\downloadRecvDir.vbs %EINV_PORTAL_URL% %RECV_FOLDER%
