call env.bat

rem ќбновление статусов обработки счетов-фактур автоматизированным сервисом портала в каталоге recv.
rem 
rem ѕолучение поступивших выполн€етс€ в следующем пор€дке: 
rem 
rem 1. ”тилита подключаетс€ к сервису по защищенному TLS соединению с авторизацией пользовател€ по сертификату.
rem 	јдрес веб сервиса определ€етс€ переменной среды EINV_PORTAL_URL.
rem 	¬ыбор ключа и сертификата клиента дл€ авторизации производитс€ из справочника MY. 
rem 
rem 2. ¬ каталоге recv выбираютс€ все файлы с именем вида "invoice-номер_счЄта_фактуры.sgn.xml"
rem
rem 3. ƒалее дл€ каждого счета-фактуры из полученного списка выполн€ютс€ следующие действи€: 
rem
rem     3.1  аждый найденный счет-фактра загружаетс€, из неЄ читаетс€ номер счета-фактуры.
rem 
rem 	3.2 ¬ каталоге recv отыскиваютс€ файлы с именем "invoice-номер_счЄта_фактуры-status-дата-статус.xml". 
rem
rem 	3.3  аждый файл загружаетс€ и читаетс€ статус.
rem
rem 	3.4 ¬ыбираетс€ самый свежий статус счета-фактуры из полученного списка статусов.
rem
rem 	3.5 ≈сли статус требует обновлени€, то есть он не окончательный, 
rem        у сервиса запрашиваетс€ текущий статус обработки счета-фактуры.
rem
rem     3.6 ѕровер€ютс€ Ё÷ѕ полученного ответа со статусом. ≈сли проверка успешна, документ
rem      сохран€етс€ в каталог recv с именем: "invoice-номер_счЄта_фактуры-status-дата-статус.xml".
rem      ≈сли проверка Ё÷ѕ завершилась неуспешно, счет-фактура сохран€етс€ с именем 
rem      "invoice-номер_счЄта_фактуры-status-дата-статус.error.xml".


%VBRUN% src\updateStatusDir.vbs updateStatusRecvDir %EINV_PORTAL_URL% %RECV_FOLDER% "sgn2"