call env.bat

rem Подписать и загрузить все счета-фактуры из каталога in.
rem 
rem Обработка счётов-фактур выполняется в следующем порядке: 
rem 
rem 1. Утилита подключается к сервису по защищенному TLS соединению с авторизацией пользователя по сертификату.
rem 	Адрес веб сервиса определяется переменной среды EINV_PORTAL_URL.
rem 	Выбор ключа и сертификата клиента для авторизации производится из справочника MY. 
rem 
rem 2. В случае успешной авторизации, производится выбор ключа и сертификата клиента для подписи счёт-фактур.
rem
rem 3. Далее для каждого обрабатываемого счёта-фактуры выполняются следующие действия: 
rem
rem 	3.1 Обрабатываемый счёт-фактура проверяется на соответствие xsd-схеме. 
rem    	Выбор XSD-схемы осуществляется автоматически в зависимости от типа счёт-фактуры: 
rem 	 	* ORIGINAL и ADD_NO_REFERENCE - проверяется согласно "MNSATI_add_no_reference.xsd";
rem 	 	* FIXED - проверяется согласно "MNSATI_fixed.xsd";
rem 	 	* ADDITIONAL - проверяется согласно "MNSATI_additional.xsd".
rem 	Все вышеперечисленные XSD-схемы должны находиться в каталоге xsd.
rem 
rem 	3.2 В случае успешной проверки на соответствие XSD-схеме, выполняется подпись счёта-фактуры, 
rem 	выбранным на шаге 2. ключом и сертификатом. Подписанный счёт-фактура сохраняется в выходной каталог out
rem     с именем: "invoice-номер_счёта_фактуры.sgn.xml".
rem 
rem 	3.3 После того как счёт-фактура успешно подписан, он отсылается на веб-сервис портала.
rem 
rem 	3.4 По результату обработки счёта-фактуры сервис возвращет ответ в виде подписанной квитанции, в которой указан 
rem 	результат обработки: принят подписанный счёт фактура или нет. Если документ не принят, указывается причина, 
rem 	по которой документ был отклонен. Утилита выполняет проверку подписи под квитанцией и проверку сертификата сервиса. 
rem 	В случае если подпись верна, квитанция помещается в выходной каталог out,
rem 	с именем: "invoice-номер_счёта_фактуры.ticket.xml", в случае ошибки в квитанции 
rem     она сохраняется с именем "invoice-номер_счёта_фактуры.ticket.error.xml"
rem 
rem     3.5 Если указан ключ командной строки -d и получен успешный ответ сервиса, то исходный файл удаляется.

%VBRUN% src\signAndUploadDir.vbs %1 %EINV_PORTAL_URL% %IN_FOLDER% %OUT_FOLDER%
