call env.bat

rem Подписать документы в папке recv второй подписью и отправить на АС портала счетов-фактур НДС
rem 
rem Обработка счетов-фактур выполняется в следующем порядке: 
rem 
rem 1. Утилита подключается к сервису по защищенному TLS соединению с авторизацией пользователя по сертификату.
rem 	Адрес веб сервиса определяется переменной среды EINV_PORTAL_URL.
rem 	Выбор ключа и сертификата клиента для авторизации производится из справочника MY. 
rem 
rem 2. В случае успешной авторизации, производится выбор ключа и сертификата клиента для подписи счетов-фактур.
rem
rem 3. Далее для каждого обрабатываемого счёта-фактуры выполняются следующие действия: 
rem
rem 	3.1 Обрабатываемый счёт-фактура - проверяется ЭЦП
rem 
rem 	3.2 В случае успешной проверки ЭЦП, выполняется подпись счёта-фактуры, 
rem 	выбранным на шаге 2. ключом и сертификатом. Подписанный счёт-фактура сохраняется в каталог recv
rem     с именем: "invoice-номер_счёт_фактуры.sgn2.xml".
rem 
rem 	3.3 После того как счёт-фактура успешно подписан, он отсылается на веб-сервис портала.
rem 
rem 	3.4 По результату обработки счёт-фактуры сервис возвращет ответ в виде подписанной квитанции, в которой указан 
rem 	результат обработки: принят подписанный счёт-фактура или нет. Если документ не принят, указывается причина, 
rem 	по которой документ был отклонен. Утилита выполняет проверку подписи под квитанцией и проверку сертификата сервиса. 
rem 	В случае если подпись верна, квитанция помещается в выходной каталог recv,
rem 	с именем: "invoice-номер_счёта_фактуры.ticket.xml", в случае ошибки в квитанции 
rem     она сохраняется с именем "invoice-номер_счёта_фактуры.ticket.error.xml"rem 

%VBRUN% src\verifySignAndUploadDir.vbs %EINV_PORTAL_URL% %RECV_FOLDER%
